Niranjan107/NC_esp32s3_gsm/sdkconfig.defaults
# ESP32-S3 Target
CONFIG_IDF_TARGET="esp32s3"

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# Main Task Configuration
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Bluetooth Configuration - Bluedroid Stack (NOT NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# BLE Configuration
CONFIG_BT_ACL_CONNECTIONS=3
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=n

# GATT Configuration
CONFIG_BT_GATT_MAX_SR_PROFILES=8
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=500

# BLE SPP Configuration
CONFIG_BLE_SPP_ENABLED=y

# UART Configuration
# Disabled UART_ISR_IN_IRAM to fix uart_read_bytes crash in ESP-IDF v5.5
CONFIG_UART_ISR_IN_IRAM=n

# Console Configuration (USB CDC)
# Use USB-CDC for console (completely frees UART0 for data)
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_UART_NONE=y

# Log Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# NVS Configuration
CONFIG_NVS_ENCRYPTION=n

# Watchdog Configuration
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Power Management (disabled for now)
CONFIG_PM_ENABLE=n

# Heap Configuration
CONFIG_HEAP_POISONING_DISABLED=y
